[
    {   
        "id":"1",
        "addedDate":"11/02/2025",
        "companyName":"BYNRY Inc",
        "position":"Senior QA Automation Engineer- Lead",
        "positionType":"Not Available",
        "salary":"Not Available",
        "workMode":"Full Time",
        "location":"Pune, India (or willing to relocate to Pune)",
        "Timing":"",
        "experienceRequired":"At least 1 year of experience",
        "mustHaveSkills":["Selenium"],
        "applyMode":"Apply on below website",
        "website":"https://sites.google.com/bynry.io/becomingbynrian/current-job-opportunities/qa-automation-engineer",
        "Description":{
            
                        "rolesAndResponsibilities":[
"● Lead and manage the QA team, ensuring the delivery of high-quality products.",
"● Design, develop, and implement comprehensive QA strategies and processes.",
"● Conduct manual and automated testing, focusing on product quality and reliability.",
"● Develop and maintain test frameworks using tools like Selenium, tailored for Angular, Django Python, and PostGres DB environments.",
"● Collaborate with cross-functional teams, including development, product management, and customer support, to understand requirements and deliver effective testing solutions.",
"● Identify, report, and track defects and ensure their resolution.",
"● Mentor and guide QA team members, fostering a culture of continuous learning and improvement. ",
"● Stay updated with the latest industry trends and best practices in QA and implement relevant advancements. ",
"● Demonstrate strong people management skills, including performance evaluation, team building, and conflict resolution.",
"● Communicate effectively with team members, stakeholders, and clients, providing clear and concise reports and updates on testing progress and results."
                        ],
                        "requirements":[
"● Bachelor’s or Master’s degree in Computer Science or a related field. ",
"● 3 to 5 years of experience in manual testing and automation. ",
"● Proven experience in setting up QA processes from scratch. ",
"● Demonstrated experience in executing various testing methodologies and scenarios. ",
"● Hands-on experience with testing tools like Selenium and relevant frameworks for Angular, Django Python, and Postgres DB environments.",
"● Strong attention to detail and critical thinking skills. ",
"● Excellent logical reasoning and problem-solving abilities. ",
"● Confidence and excellent communication skills. ",
"● Passion for delivering high-quality products. ",
"● Good people management skills, with experience in leading and mentoring QA teams. ",
"● Sharp comprehension skills and the ability to understand complex systems and requirements."]
                    }


    },
    {   
        "id":"2",
        "addedDate":"02/02/2025",
        "companyName":"Hexaware Technologies",
        "position":"ServiceNow Associate",
        "positionType":"Not Available",
        "salary":"Not Available",
        "workMode":"Not Available",
        "location":"Pune",
        "Timing":"",
        "experienceRequired":"3 years experience",
        "mustHaveSkills":["Apply Mode - Form","Javascript","AngularJS"],
        "applyMode":"(Form) - ",
        "website":"https://forms.office.com/pages/responsepage.aspx?id=9TYMfIOvJEyIRJli4BY3GbBIV4MHlLBJpBu1M2M_eYdUMVhUTkMwVTBFMDNPWlE4SkwyNVpXWE5ZOS4u&route=shorturl",
        "jobsource":"https://www.linkedin.com/jobs/view/4136368382",
        "Description":{
            
                        "rolesAndResponsibilities":["Collaborate with our experienced team to understand and deliver solutions using the ServiceNow platform.",
                        "Participate in the development, configuration, and customization of ServiceNow applications.",
                        "Assist in identifying areas for process improvement and automation within ServiceNow.",
                        "Engage in documentation and knowledge sharing for best practices and solutions.",
                        "Fully committed to working from office 5 days a week and in a shift environment],"],
                        "requirements":["Minimum of 3 years and Maximum of 4 Years of hands-on development experience in JavaScript or Angular JS",

                        "Exposure to Agile methodolog",
                
                        "Working on scrum storie",
                
                        "Attending daily stand-up",
                
                        "Testing and functional experience will not be considered",
                
                        "Strong problem-solving and analytical skills",
                
                       " Excellent communication and teamwork skills."]
                    }


    },
    {   
        "id":"3",
        "addedDate":"02/02/2025",
        "companyName":"Birlasoft",
        "position":"Salesforce Developer",
        "positionType":"Not Available",
        "salary":"Not Available",
        "workMode":"Not Available",
        "location":"Bengaluru, Karnataka, India",
        "Timing":"",
        "experienceRequired":"5- 8 years experience",
        "mustHaveSkills":["Apply Mode - Mail","Salesforce Service Cloud / Sales Cloud Salesforce Apex, Visualforce, Flows, Triggers, fields, page layouts, record types, custom settings, dashboards and reports","Integration SOAP, REST, Bulk API), integration patterns, and best practices."],
        "applyMode":"(Mail) - ",
        "website":"kumari.singh@birlasoft.com",
        "Description":{
            
                        "rolesAndResponsibilities":[
                        "Must have at least 5- 8 Years of SFDC development and implementation experience.",
                        "Experience in building Salesforce apps from development to support.",
                        "In-depth understanding of the capabilities and constraints of the SFDC CRM/PRM applications.",
                        "Ability to Identify and gather requirements from users and stakeholders.",
                        "Analyze detailed business/functional/technical requirements and specifications for the application.",
                        "Supporting application testing, deployment, maintenance, and evolution activities by correcting programming errors, responding to scope changes, and coding application enhancements.",
                        "Knowledge on APIs and security settings.",
                        "Good verbal and written communication skills."
                    ],

                        "requirements":[
                            "Typically, a technical Bachelor's degree or equivalent experience or a Master's degree and a minimum of 3 years and up to 8 years of related experience.",
                            "Primary Skills:",
                            "Salesforce Service Cloud / Sales Cloud",
                            "Salesforce CRM/PRM Modules.",
                            "Salesforce Apex, Visualforce, Flows, Triggers, fields, page layouts, record types, custom settings, dashboards and reports",
                            "Lightning (Aura, LWC), HTML, CSS, JavaScript",
                            "Integration SOAP, REST, Bulk API), integration patterns, and best practices.",
                            "Knowledge of Salesforce PRM"
                    ]
                    }


    },
    {   
        "id":"4",
        "addedDate":"02/02/2025",
        "companyName":"Nagarro",
        "position":"Salesforce Developer",
        "positionType":"Not Available",
        "salary":"Not Available",
        "workMode":"Not Available",
        "location":"Chennai",
        "Timing":"",
        "experienceRequired":"5- 10 years experience",
        "mustHaveSkills":["Apply Mode - Mail","Strong expertise in Lightning Web Components (hashtag#LWC)"],
        "applyMode":"(Mail) - ",
        "website":"Kshama.chanda@nagarro.com",
        "Description":{
            
                        "rolesAndResponsibilities":[
                        "Not Mentioned"
                       
                    ],

                        "requirements":[
                            "Not Available"
                    ]
                    }


    },
    {   
        "id":"5",
        "addedDate":"02/02/2025",
        "companyName":"Ascendion",
        "position":"Dotnet Developer",
        "positionType":"Not Available",
        "salary":"Not Available",
        "workMode":"Not Available",
        "location":"Bengaluru, Pune, Chennai, Hyderabad, Vadodara (Hybrid work)",
        "Timing":"2-11 pm",
        "experienceRequired":"Not Mentioned",
        "mustHaveSkills":["Apply Mode - Mail","Strong expertise in Lightning Web Components (hashtag#LWC)"],
        "applyMode":"(Mail) - ",
        "website":"harshita.sahu@ascendion.com",
        "Description":{
            
                        "rolesAndResponsibilities":[
                           "Collaborate with cross-functional teams to design, develop, and deploy scalable software solutions for loan depot customer acquisition operations.",
                           "Utilize your expertise in C# 10 and .NET 6 to build robust API services, ensuring optimal performance, security, and reliability.",
                           "Azure Service Bus",
                           "Collaborate with QA teams to identify and resolve software defects and performance issues.",
                           "Minimal Kubernetes Experience"
                       
                    ],

                        "requirements":[
                            "Not Available"
                    ]
                    }


    },
    {   
        "id":"6",
        "addedDate":"10/02/2025",
        "companyName":"Faclon Labs",
        "position":"Backend Developer L1",
        "positionType":"Full Time",
        "salary":"Not Available",
        "workMode":"Remote",
        "location":"Mumbai, Maharashtra",
        "Timing":"Not Mentioned",
        "experienceRequired":"1-2 Years",
        "mustHaveSkills":["Node.js","MongoDB","basics of REST APIs"],
        "applyMode":"Website",
        "website":"https://www.faclon.com/job-description1",
        "Description":{
            
                        "rolesAndResponsibilities":[
                            "You'll be part of a team of engineers focused on building out critical components of our Engineering team.",
                            "Partner with the product and UX/UX teams and other cross functional partners to develop overall vision, strategy and roadmap for our engineering systems and product suites.",
                            "Champion engineering and operational excellence, establishing metrics and processes for regular assessment and improvement.",
                            "Establish a solid project framework and excellent development processes.",
                            "Be open with ideas around technical and architectural direction for the development, design, integration, testing, and maintenance of our products.",
                            "Follow agile software processes for the engineering team and introduce best-in-class industry practices.",
                            "Handle technical debt to ensure our development velocity stays responsive and predictable while minimizing production incidents of our operations."
                       
                    ],

                        "requirements":[
                                        "1 - 2 years of work experience architecting, developing, and shipping well tested software products and/or services.",
                                        "Strong analytic skills and a demonstrated sense of ownership and accountability.",
                                        "Excellent communication and interpersonal skills and the ability to work with a wide variety of people.",
                                        "A service-oriented mentality while driving excellence across the organization.",
                                        "Strong organizational skills, both for yourself and the team.",
                                        "The ability to balance business needs, a sense of urgency, conflicting constraints, and shipping high quality and pragmatic solutions in a fast-moving and quickly-growing company.",
                                        "Bachelors/Masters in Computer Science or related field/equivalent practical experience, experience in MEAN stack is a big plus.",
                                        "Interest in building things from scratch and being a decision maker here.",
                                        "Critical thinking and problem-solving skills.",
                                        "Attention to detail and keen eye to build the perfect product."
                    ]
                    }


    },
    {   
        "id":"7",
        "addedDate":"10/02/2025",
        "companyName":"Faclon Labs",
        "position":"Backend Developer L2",
        "positionType":"Full Time",
        "salary":"Not Available",
        "workMode":"Remote",
        "location":"Mumbai, Maharashtra",
        "Timing":"Not Mentioned",
        "experienceRequired":"2-4 Years",
        "mustHaveSkills":["Node.js","MongoDB","basics of REST APIs"],
        "applyMode":"Website",
        "website":"https://www.faclon.com/job-description2",
        "Description":{
            
                        "rolesAndResponsibilities":[
"You'll build a team of engineers focused on building out critical components of our Engineering team.",
"Support all facets of team management to attract, engage, retain, and nurture teams of outstanding engineers (e. g., recruitment, mentoring, training and development, performance evaluation).",
"Partner with the product and UX/UX teams and other cross functional partners to develop overall vision, strategy and roadmap for our engineering systems and product suites.",
"Champion engineering and operational excellence, establishing metrics and processes for regular assessment and improvement.",
"Establish a solid project framework and excellent development processes.",
"Drive an excellent experience, continuously raising the bar on functionality, usability, and simplicity.",
"Provide technical and architectural direction for the development, design, integration, testing, and maintenance of our products.",
"Lead agile software processes for the engineering team and introduce best-in-class industry practices.",
"Handle technical debt to ensure our development velocity stays responsive and predictable while minimizing production incidents of our operations."
                    ],

                        "requirements":[
                            "Experience in hiring and performance management of backend teams at SaaS offering companies.",
                            "Experience in leading engineering teams, including experience in managing Tech Leads.",
                            "2 - 4 years of work experience architecting, developing, and shipping well tested software products and/or services.",
                            "Strong analytic skills and a demonstrated sense of ownership and accountability.",
                            "Excellent communication and interpersonal skills and the ability to work with a wide variety of people.",
                            "A service-oriented mentality while driving excellence across the organization.",
                            "Strong organizational skills, both for yourself and the team.",
                            "Business acumen: Proven understanding of business dynamics, goals, and product strategy. Knowledge of how Engineering fits into the company's overall business.",
                            "The ability to balance business needs, a sense of urgency, conflicting constraints, and shipping high quality and pragmatic solutions in a fast-moving and quickly-growing company.",
                            "Bachelors/Masters in Computer Science or related field/equivalent practical experience, experience in MEAN stack is a big plus.",
                            "Interest in building things from scratch and being a decision maker here.",
                            "Critical thinking and problem-solving skills.",
                            "Attention to detail and keen eye to build the perfect product."
                    ]
                    }


    },
    {   
        "id":"8",
        "addedDate":"14/02/2025",
        "companyName":"Synechron",
        "position":"Senior Java Fullstack Developer",
        "positionType":"Full Time",
        "salary":"Not Available",
        "workMode":"Hybrid",
        "location":"Pune, Maharashtra",
        "Timing":"Not Mentioned",
        "experienceRequired":"7 years",
        "mustHaveSkills":[" Java", "AngularJS"," HTML", "CSS", "JavaScript", "Linux", "PHP", "Apache"," MySQL", "Express.js", "Node.js"],
        "applyMode":"send resume to - Yekata.shriwas@synechron.com",
        "website":"",
        "Description":{
            
                        "rolesAndResponsibilities":[
                            "Architect and develop digital ecosystems, ensuring a seamless balance between client and server-side for a highly responsive user interface.",
                            "Create new, dynamic front-end and back-end software products and applications that are dynamic and visually appealing.",
                            "Develop entire architecture, responsive design, user interaction, and user experience.",
                            "Collaborate with development teams and product managers to create innovative software solutions.",
                            "Keep up with the latest advancements in programming languages and server apps.",
                            "Offer suggestions for ongoing improvement and add or remove features as necessary.",
                            "Design a plan for stability, scalability, performance optimization, and ongoing improvement."
                    ],

                        "requirements":[
                            "Proficiency in Java, AngularJS, HTML, CSS, JavaScript, Linux, PHP, Apache, MySQL, Express.js, Node.js, and Angular.",
"Knowledge of database management, APIs, version control systems, and third-party applications.",
"Ability to develop entire architecture, responsive design, user interaction, and user experience.",
"Experience with creating APIs based on the architecture of the production application.",
"Familiarity with web architecture and design basics."
                    ]
                    }


    }

    

]