[
   
    {   
        "id":"1",
        "addedDate":"11/02/2025",
        "companyName":"Synergy Technology Services",
        "position":"Junior Software Developer",
        "positionType":"Full Time Permanent Position",
        "salary":"₹ 2,00,000 - 3,24,000",
        "workMode":"Full Time",
        "location":"Mumbai",
        "Timing":"",
        "experienceRequired":"Freshers Applicable",
        "mustHaveSkills":[ 
        ".NET",
        "C++ Programming",
        "CSS",
        "HTML",
        "Java",
        "JavaScript",
        "MySQL",
        "Node.js",
        "PHP",
        "Python",
        "ReactJS" ],
        "applyMode":"Company site",
        "applyLink":"https://www.stspl.com/career/current-openings/",
        "Description":{
            
                        "rolesAndResponsibilities": [
                            
                            "Work on the front end - HTML5, CSS3"
                            
],





                        "requirements":[
                            "Duration: 6 months Salary during probation: ₹10,000 - 15,000 /month (only for freshers)"
]
                    }


    },
    {   
        "id":"2",
        "addedDate":"11/02/2025",
        "companyName":"Revalsys Technologies",
        "position":"SQL Developer Fresher",
        "positionType":"Full Time Permanent Position",
        "salary":"salary Not Provided",
        "workMode":"Full Time",
        "location":"Hyderabad",
        "Timing":"",
        "experienceRequired":"Freshers Applicable",
        "mustHaveSkills":[ 
        "SQL Server" ],
        "applyMode":"Company site",
        "applyLink":"https://www.revalsys.com/sql-developer-fresher.html",
        "Description":{
            
                        "rolesAndResponsibilities": [
                            
"Assist in the design, implementation, and maintenance of SQL Server databases.",
"Write and optimize SQL queries to ensure efficient data retrieval and manipulation.",
"Collaborate with senior database administrators and developers to understand and implement database requirements.",
"Participate in database backup and recovery processes.",
"Ensure data integrity and security by following best practices and company policies."
                            
],





                        "requirements":[
"Good knowledge of SQL Server and SQL programming.",
"Strong analytical and problem-solving skills.",
"Excellent communication and teamwork abilities.",
"Eagerness to learn and adapt to new technologies and methodologies.",
"Attention to detail and a commitment to delivering high-quality work."
]
                    }


    },
    {   
        "id":"3",
        "addedDate":"14/02/2025",
        "companyName":"Aeries Technology",
        "position":"Trainee - Web Developer",
        "positionType":"Full Time Permanent Position",
        "salary":"salary Not Provided",
        "workMode":"Full Time",
        "location":"Hyderabad",
        "Timing":"",
        "experienceRequired":"Fresher - 2 years",
        "mustHaveSkills":[ 
            "React.js", "Angular"],
        "applyMode":"Company site",
        "applyLink":"https://aeriestechnology.talentrecruit.com/Search/Jobs/?1997-Trainee--%20Web%20Developer",
        "Description":{
            
                        "rolesAndResponsibilities": [
                            
                            "Design, develop, and maintain web applications using Python and web frameworks such as Django, Flask, or FastAPI.",
                            "Write clean, maintainable, and efficient code to implement features and fix bugs.",
                            "Work with front-end technologies such as HTML, CSS, JavaScript, and frameworks like React or Angular to ensure seamless integration between front-end and back-end.",
                            "Collaborate with UI/UX designers to translate application wireframes and designs into functional web applications.",
                            "Optimize web applications for speed and scalability.",
                            "Implement secure and robust APIs to support web applications.",
                            "Participate in code reviews to maintain high coding standards.",
                            "Work closely with the QA team to ensure the quality and functionality of the application.",
                            "Troubleshoot and debug issues that arise in the development or production environment.",
                            "Stay up-to-date with emerging technologies and industry trends, continuously enhancing your skills"
                            
],





                        "requirements":[
"Strong proficiency in Python and web frameworks like Django, Flask, or FastAPI.",
"Solid understanding of front-end technologies (HTML, CSS, JavaScript, AJAX, etc.).",
"Experience with relational databases (e.g., MySQL, PostgreSQL) and ORM tools like SQLAlchemy or Django ORM.",
"Familiarity with RESTful API development and integration.",
"Strong knowledge of version control systems (e.g., Git).",
"Experience with cloud platforms (e.g., AWS, Google Cloud, Azure) and deployment tools (e.g., Docker, Kubernetes) is a plus.",
"Knowledge of web security best practices and application vulnerability mitigation.",
"Good understanding of Agile methodologies and software development lifecycle (SDLC).",
"Excellent problem-solving skills and ability to work independently and in a team.",
"Strong communication skills and ability to collaborate with team members and stakeholders."
]
                    }


    },
    {   
        "id":"4",
        "addedDate":"20/02/2025",
        "companyName":"IBM",
        "position":"Associate System Engineer",
        "positionType":"Full Time Permanent Position",
        "salary":"salary Not Provided",
        "workMode":"Full Time",
        "location":"all over India",
        "Timing":"",
        "experienceRequired":"Fresher",
        "mustHaveSkills":[ 
            "Java", "C++", "Python", "Node.js"],
        "applyMode":"Company site",
        "applyLink":"https://ibmglobal.avature.net/en_US/careers/JobDetail?jobId=7789&source=WEB_Search_NA&utm_source=pocket_saves",
        "Description":{
            
                        "rolesAndResponsibilities": [
                            
                            "As a Software Developer you'll participate in many aspects of the software development lifecycle, such as design, code implementation, testing, and support. You will create software that enables your clients' hybrid-cloud and AI journeys. You'll have the opportunity to work with the latest technologies, ensuring the applications delivered are high performing, highly available, responsive, and maintainable. Your primary responsibilities include: Analytical Problem-Solving and Solution Enhancement: Analyze, validate and propose improvements to existing failures, with the support of the architect and technical leader. Comprehensive Engagement Across Process Phases: Involvement in every step of the process, from design, development, testing release changes and troubleshoot where necessary, providing a great customer service. Strategic Stakeholder Engagement and Innovative Coding Solutions: Drive key discussions with your stakeholders and analyze the current landscape for opportunities to operate and code creative solutions."
                            
],





                        "requirements":[
"Programming (preferably in Java, C++, Python, Node.js) & Software Development Life Cycle Concepts",
"This is an entry level Off-Campus hiring position and the candidates must have completed their education and obtained their degree.",
"Course Completion Year should be 2024 Only.",
"BE/BTech/ME/MTech/Dual Degree/MSc/MCA in CS/ IT OR other Semi IT/ circuit branches with 6.0 CGPA/60%. Calculation of qualifying marks=Sum of marks obtained divided by Sum total of maximum marks obtainable. All subjects will be considered including elective/optional subjects."
]
                    }


    },
    {   
        "id":"5",
        "addedDate":"20/02/2025",
        "companyName":"InnovationM",
        "position":"Associate System Engineer",
        "positionType":"Full Time Permanent Position",
        "salary":"salary Not Provided",
        "workMode":"Full Time",
        "location":"all over India",
        "Timing":"",
        "experienceRequired":"0.6 - 1 year",
        "mustHaveSkills":[ 
            "Java", "React.js"],
        "applyMode":"Referral Send resume to neha.sharma@innovationm.com.",
        "applyLink":"",
        "Description":{
            
                        "rolesAndResponsibilities": [
                            
                            
],





                        "requirements":[

                        ]
                    }


    }
]