[
    {   
        "id":"1",
        "addedDate":"03/02/2025",
        "companyName":"CloudGemini Solutions",
        "position":"Python Developer Internship",
        "positionType":"Internship-Full Time - with job offer",
        "salary":"Stipend Not mentioned",
        "workMode":"Remote",
        "location":"Remote",
        "experienceRequired":"Freshers Applicable",
        "mustHaveSkills":[
                                "Basic knowledge of Python programming"
                        ],
        "applyMode":"Website",
        "applyLink":"https://cloudgeminisolutions.zohorecruit.in/jobs/Careers/164230000000938758/Python-Developer-Internship-Remote?source=LinkedIn-Basic&embedsource=LinkedIn%2BLimited%2BListings",
        "Description":{
            
                        "rolesAndResponsibilities":[
                            "Assist in the design, development, and maintenance of Python-based applications and backend services.",
                            "Write clean, efficient, and well-documented code, following best coding practices.",
                            "Collaborate with senior developers to build, test, and deploy web applications and software.",
                            "Participate in code reviews to maintain high-quality standards and ensure the delivery of robust applications.",
                            "Work on debugging, troubleshooting, and optimizing Python code for improved performance and scalability.",
                            "Participate in creating and maintaining APIs for internal and external systems.",
                            "Learn and apply industry best practices in Python programming and software development.",
                            "Test and deploy applications and systems, ensuring they are functional and user-friendly.",
                            "Assist in maintaining version control and collaborate with team members using Git."
                        ],

                        "requirements":[
                            "Recent graduate or student with a background in Computer Science, Information Technology, or a related field.",
                            "Basic knowledge of Python programming, object-oriented programming (OOP), and data structures.",
                            "Familiarity with web development frameworks like Django or Flask is a plus.",
                            "Strong understanding of version control systems (e.g., Git).",
                            "Ability to learn new programming languages and technologies quickly.",
                            "Familiarity with databases (e.g., MySQL, PostgreSQL, or MongoDB) is an advantage.",
                            "Strong problem-solving and analytical skills.",
                            "Good communication skills and the ability to work collaboratively in a remote environment.",
                            "A passion for coding and building innovative software solutions."

                        ]
                    }


    }
]